import json
import time
from threading import Thread
import winsound
timetable={
 "Понедельник":{ 
    "1 урок":{"предварительный":"16:44:00",
              "начало":"16:44:30",
              "конец":"16:45:00"}, 
    "2 урок":{"предварительный":"09:29:00",
              "начало":"09:30:00",
              "конец":"10:15:00"}, 
    "3 урок":{"предварительный":"10:34:00",
              "начало":"10:35:00",
              "конец":"11:20:00"}, 
    "4 урок":{"предварительный":"11:29:00",
              "начало":"11:30:00",
              "конец":"12:15:00"}, 
    "5 урок":{"предварительный":"12:34:00",
              "начало":"12:35:00",
              "конец":"13:20:00"}, 
    "6 урок":{"предварительный":"13:29:00",
              "начало":"13:30:00",
              "конец":"14:15:00"}, 
    "7 урок":{"предварительный":"14:24:00",
              "начало":"14:25:00",
              "конец":"15:10:00"}, 
    "8 урок":{"предварительный":"15:19:00",
              "начало":"15:20:00",
              "конец":"16:05:00"}, 
    "9 урок":{"предварительный":"16:24:00",
              "начало":"16:25:00",
              "конец":"17:10:0"}
    },
 "Вторник":{
    "1 урок":{"предварительный":"08:29:00",
              "начало":"08:30:00",
              "конец":"09:15:00"}, 
    "2 урок":{"предварительный":"09:29:00",
              "начало":"09:30:00",
              "конец":"10:15:00"}, 
    "3 урок":{"предварительный":"10:34:00",
              "начало":"10:35:00",
              "конец":"11:20:00"}, 
    "4 урок":{"предварительный":"11:29:00",
              "начало":"11:30:00",
              "конец":"12:15:00"}, 
    "5 урок":{"предварительный":"12:34:00",
              "начало":"12:35:00",
              "конец":"13:20:00"}, 
    "6 урок":{"предварительный":"13:29:00",
              "начало":"13:30:00",
              "конец":"14:15:00"}, 
    "7 урок":{"предварительный":"14:24:00",
              "начало":"14:25:00",
              "конец":"15:10:00"}, 
    "8 урок":{"предварительный":"15:19:00",
              "начало":"15:20:00",
              "конец":"16:05:00"}, 
    "9 урок":{"предварительный":"16:24:00",
              "начало":"16:25:00",
              "конец":"17:10:0"}
    },
 "Среда":{ 
    "1 урок":{"предварительный":"08:29:00",
              "начало":"08:30:00",
              "конец":"09:15:00"}, 
    "2 урок":{"предварительный":"09:29:00",
              "начало":"09:30:00",
              "конец":"10:15:00"}, 
    "3 урок":{"предварительный":"10:34:00",
              "начало":"10:35:00",
              "конец":"11:20:00"}, 
    "4 урок":{"предварительный":"11:29:00",
              "начало":"11:30:00",
              "конец":"12:15:00"}, 
    "5 урок":{"предварительный":"12:34:00",
              "начало":"12:35:00",
              "конец":"13:20:00"}, 
    "6 урок":{"предварительный":"13:29:00",
              "начало":"13:30:00",
              "конец":"14:15:00"}, 
    "7 урок":{"предварительный":"14:24:00",
              "начало":"14:25:00",
              "конец":"15:10:00"}, 
    "8 урок":{"предварительный":"15:19:00",
              "начало":"15:20:00",
              "конец":"16:05:00"}, 
    "9 урок":{"предварительный":"16:24:00",
              "начало":"16:25:00",
              "конец":"17:10:0"}
    },
 "Четверг":{ 
    "1 урок":{"предварительный":"08:29:00",
              "начало":"08:30:00",
              "конец":"09:15:00"}, 
    "2 урок":{"предварительный":"09:29:00",
              "начало":"09:30:00",
              "конец":"10:15:00"}, 
    "3 урок":{"предварительный":"10:34:00",
              "начало":"10:35:00",
              "конец":"11:20:00"}, 
    "4 урок":{"предварительный":"11:29:00",
              "начало":"11:30:00",
              "конец":"12:15:00"}, 
    "5 урок":{"предварительный":"12:34:00",
              "начало":"12:35:00",
              "конец":"13:20:00"}, 
    "6 урок":{"предварительный":"13:29:00",
              "начало":"13:30:00",
              "конец":"14:15:00"}, 
    "7 урок":{"предварительный":"14:24:00",
              "начало":"14:25:00",
              "конец":"15:10:00"}, 
    "8 урок":{"предварительный":"15:19:00",
              "начало":"15:20:00",
              "конец":"16:05:00"}, 
    "9 урок":{"предварительный":"16:24:00",
              "начало":"16:25:00",
              "конец":"17:10:0"}
    },
 "Пятница":{
    "1 урок":{"предварительный":"08:29:00",
              "начало":"08:30:00",
              "конец":"09:15:00"}, 
    "2 урок":{"предварительный":"09:29:00",
              "начало":"09:30:00",
              "конец":"10:15:00"}, 
    "3 урок":{"предварительный":"10:34:00",
              "начало":"10:35:00",
              "конец":"11:20:00"}, 
    "4 урок":{"предварительный":"11:29:00",
              "начало":"11:30:00",
              "конец":"12:15:00"}, 
    "5 урок":{"предварительный":"12:34:00",
              "начало":"12:35:00",
              "конец":"13:20:00"}, 
    "6 урок":{"предварительный":"13:29:00",
              "начало":"13:30:00",
              "конец":"14:15:00"}, 
    "7 урок":{"предварительный":"14:24:00",
              "начало":"14:25:00",
              "конец":"15:10:00"}, 
    "8 урок":{"предварительный":"15:19:00",
              "начало":"15:20:00",
              "конец":"16:05:00"}, 
    "9 урок":{"предварительный":"16:24:00",
              "начало":"16:25:00",
              "конец":"17:10:0"}
    },
   }
def soundpreliminary ():
    winsound.PlaySound('C:\\Users\\rezik\\Downloads\\БрегвадзеТбилисо__allmp3-_mp3cut.net_.WAV', winsound.SND_FILENAME)
def soundstart ():
    winsound.PlaySound('C:\\Users\\rezik\\Downloads\\Pop-Smoke-Dior-_mp3store.cc_-_AudioTrimmer.com_.WAV', winsound.SND_FILENAME)   
def soundend ():
    winsound.PlaySound('C:\\Users\\rezik\\Downloads\\lil-pump-gucci-gang-_AudioTrimmer.com_.WAV', winsound.SND_FILENAME)    
#print(timetable["Понедельник"]["1 урок"]["предварительный"])
while True:
    named_tuple = time.localtime()
    time_string = time.strftime("%H:%M:%S", named_tuple)
    print(time_string)
    print(timetable["Понедельник"]["1 урок"]["предварительный"])
    time.sleep(1)

    if time_string == (timetable["Понедельник"]["1 урок"]["предварительный"]) or time_string == (timetable["Понедельник"]["2 урок"]["предварительный"]) or time_string == (timetable["Понедельник"]["3 урок"]["предварительный"]) or time_string == (timetable["Понедельник"]["4 урок"]["предварительный"]) or time_string == (timetable["Понедельник"]["5 урок"]["предварительный"]) or time_string == (timetable["Понедельник"]["6 урок"]["предварительный"]) or time_string == (timetable["Понедельник"]["7 урок"]["предварительный"]) or time_string == (timetable["Понедельник"]["8 урок"]["предварительный"]) or time_string == (timetable["Понедельник"]["9 урок"]["предварительный"]):
        th=Thread(target=soundpreliminary)
        th.start()    
    if  time_string == (timetable["Понедельник"]["1 урок"]["начало"]) or time_string == (timetable["Понедельник"]["2 урок"]["начало"]) or time_string == (timetable["Понедельник"]["3 урок"]["начало"]) or time_string == (timetable["Понедельник"]["4 урок"]["начало"]) or time_string == (timetable["Понедельник"]["5 урок"]["начало"]) or time_string == (timetable["Понедельник"]["6 урок"]["начало"]) or time_string == (timetable["Понедельник"]["7 урок"]["начало"]) or time_string == (timetable["Понедельник"]["8 урок"]["начало"]) or time_string == (timetable["Понедельник"]["9 урок"]["начало"]):
        th=Thread(target=soundstart)
        th.start()
        #ниже приведена команда воспроизводящая аудиофайл,  а данном случае это трек "gucci-gang" исполнителя lil-pump. принцип работы команды черезвычайно прост, идёт сравнение текущего времени с временем окончания каждого урока из расписания, и если равенство выполняется воспроизводится аудиозапись
    if  time_string == (timetable["Понедельник"]["1 урок"]["конец"]) or time_string == (timetable["Понедельник"]["2 урок"]["конец"]) or time_string == (timetable["Понедельник"]["3 урок"]["конец"]) or time_string == (timetable["Понедельник"]["4 урок"]["конец"]) or time_string == (timetable["Понедельник"]["5 урок"]["конец"]) or time_string == (timetable["Понедельник"]["6 урок"]["конец"]) or time_string == (timetable["Понедельник"]["7 урок"]["конец"]) or time_string == (timetable["Понедельник"]["8 урок"]["конец"]) or time_string == (timetable["Понедельник"]["9 урок"]["конец"]):
        th=Thread(target=soundend)
        th.start()           